[
  {
    "username": "FlamesFan",
    "comment": "Went on a nice 1 hour dinner date followed up by a 1 hour session. She has an amazing personality and the body and the service is top notch. Such a shame i'll be going to New York for work. Her art is also very brilliant, thanks again hun."
  },
  {
    "username": "mrgogo82",
    "comment": "Love ur new pics doesn’t do you justice though in person my love"
  },
  {
    "username": "indianhater",
    "comment": "Haven’t seen ur ad posted in months now if you’re seeing this please give me an update when you’ll be doing services again! -the guy who spilled redwine on himself lol"
  },
  {
    "username": "batman0918",
    "comment": "Big sweetheart super easy to book with and her art is amazing. Super easy to talk to, had to stop myself from chatting with her in person cause I didn’t want to waste any time and wanted to jump into the action.. couldnt get enough as you can tell from our interaction.. beautiful in person and astounding body, russian accent makes it all even better.. Very rare girl here in Canada so i understand why she takes lots of precautions with the booking with the art, very smart. Beauty, brains, and body .. glad I can support your art career as well xoxo",
    "image": "convo.png"
  },
  {
    "username": "cbdestaban",
    "comment": "Had a great time. Her Russian accent is to die for I paid for 2 hours and it was surreal. Not to get away from the action but the way she performed FS made me feel that she enjoyed it as well and it wasn’t a forced interaction, and even after FS we had a great time with whatever time remained. She will definitely be my regular go to now."
  },
  {
    "username": "deportTrudeau",
    "comment": "Finally was able to see her! I had a good idea of what I was getting myself into as I did her bonus offer as mentioned in the booking procedure to buy her digital art fully as the payment and got her $300 video bundle for free which came with got me more impatient to see her .. definitely recommend going that route if ur a buildup kinda guy like me. Incall was very discrete, service was pure GFE but for the 2nd hour i paid extra for the PSE and definitely the best option with the filming if you want the true experience.. Not to mention her face looks even better in person especially filmed. But unfortunately the only negative thing I can say is she was just visiting my city for a week. Will be keeping myself busy with that film and free videos in the meantime, ciao!"
  },
  {
    "username": "ecothepassenger",
    "comment": "She gives the BEST sloppy blowjobs and takes the cum in her mouth like a queen. I can see she lives up to the professional ballet dancer title with her flexibility during the session. The way she was riding me in the splits position unlocked a new kink for me. Def lives up to the reviews from those other websites she has linked from other countries which I didn’t notice till now"
  },
  {
    "username": "Hornydog",
    "comment": "The deposit was fast and easy which was done to buy her art which I liked. I’m married so this made it more discrete. Was a little weirded out at first as I never done a deposit by paying for something but I sent the etransfer to the art website and i got her art right away to my email. I’ll have to admit I think the future for paying for these services for a deposit should be like this lol Her incall was in a very discrete location and as soon as I opened the door when she gave me the buzzer it was too good to be true. Words cannot explain her beauty, I understand why she has to blur her face on her ads but I believe if it wasn’t she would be booked by every man in the city, the rest is history. Treat her right fellas"
  },
  {
    "username": "henrywigga3",
    "comment": "what can I say. I saw this exotic Beauty was visiting Brampton recently. Booking was easy i bought her art which was fast although I ran a little late, I reached her hotel. My booking was for an hour with DOM. She had every toy necessary to fulfill my deepest desires. Wasn’t surprised about her DOM skills as she is russian and you know what they say about russians FYI MAKE SURE TO PUT HER ART AS UR BACKGROUND if you do end up doing that for the deposit instead of the amazon one 10/10 SURPRISE"
  },
  {
    "username": "lonelynights",
    "comment": "Saw her for HH for an heavily scripted Domme + fetish session, Location: 9/10 Clean and private location Communication: 10/10 Fast & convinent. Virtually no wait between texts. Kept me informed throughout & answered all my questions without the attitude. Appearance: 10/10 Reminds me a lot of Irina Shayk, her eyes were piercing at me and felt like she could get me hard just by staring into my eyes lol, her body is the perfect hourglass figure with a nice rack and bubble butt. Attitude/personality : 10/10 Genuine, open-minded, and drama free. Bit of a sweetheart & even asks for feedback after the session! I had made some very specific requests and she delivered + maybe even Overcompensated. A good conversationalist & down to earth person, the type of people I enjoy the company of. Very energetic aswell! Hygiene: 10/10 Smells & tastes good! Check. Service delivered: 10/10 Delivered energetically & with much enthusiasm. Safe to say I was completely drained of energy by the end of the scene, slept like a baby tonight. Overall Comments: - She seems like shes quite occupied with her art and available select days as shes busy with her art and tours a lot. Contact her to find out! - Yet Another Reliable & affordable provider She can be a sweet heart or a mean bitch if ur into the rough side like I am with request whatever floats your boat. -No complaints. - She is very understanding & tries to fulfill your request to the best of her abilities. Repeat: Yes"
  },
  {
    "username": "goldenboy22",
    "comment": "Looks - Pictures are real. She's a good looking girl. Just a bonus but found out she’s bisexual and does couples so will do this with my wife next. Body - if her face somehow doesn't turn their heads her silhouette certainly will. she's petite, thin with a bubble but. I'm not a fan of her bubble but I have no doubt that others would be. Attitude - Very bubbly and seemed like a very 'chill' lady. Service - Overall amazing, she knows how to buildup ill let ur imaginations run! She jumped into reverse cowgirl before I was fully (ahem) prepared.But not prepared for her flexibility tricks.Wow. In hindsight, she's not a mind reader and I should have been more clear in my expectations. That said, overall experience was still 10/10 Cost $400 for the hour in all at a nice hotel Recommend - Ya Summary - If you've always wanted to get with a normally unattainable hot russian type with killer body and face then this is ur chance. if nothing else, you'll forever be able to hold on to the impressive visuals burned into your mind."
  },
  {
    "username": "Downterrible",
    "comment": "Recently I had yet another chance to rendevous with the russian doll. we met at the door, and like always, the soft sensual GFE kisses started immediately. We both knew we had lots of time for chatter later on, so it was quickly to the play...err...the dungeo....ummmm...'the bedroom' to remind ourselves why we have soooo friggin' much FUN together!! Her energy and looks are immaculate and body that causes the loins to stir when thought of. This russian princess is not by any means a clock watcher, focusing on only making sure that BOTH people in the room are thoroughly enjoying themselves...quite likely why she's been so highly acclaimed and reviewed as on those other review websites, and remaining busy at that. She certainly knows what turns my crank. :O) All details pertinent to a possible rendevous of your own with this lovely gal can be found on this website....first once on her website....go to Booking Form."
  },
  {
    "username": "russianlover88",
    "comment": "I thought that I was the only one that she made feel special!!! PS: She is one of the 'nicest persons' I have ever met and yet she is still smoking Hot!!!"
  },
  {
    "username": "goodtimesbadboy",
    "comment": "Thought I should better report on this beautiful russian woman before too much time had gone by. Booked her twice now once in Edmonton and now as she was in Calgary last week. I was skeptical about the deposit as this is definitely not the traditional way. She sent me her art piece link on an art site and I filled out the information to buy her art and sent the etransfer as described on the site, this all took maybe 30 seconds, I used to be paranoid about sending money to providers like her but it showed on my end through my bank im only paying for art. Bonus that she also has many reviews which made me feel secure, now to the good part I found that she was just my type about 5'3 and 115-120lbs with amazing DD cups. She has beautiful greenish/blue eyes that changed colour right before my eyes depending on the light. She is quite attractive with glistening skin and brown hair. I found her English to be amazingly good and hot with her accent, most services were offered, I was so attracted to her I actually got off again as its msog. I didn't much care for the need for elevator key or having her come down, this was the case for me and she was wearing a tank top with no bra and very short shorts....the guy coming out of the elevator knew what was going on. This was almost a deal killer for me. Should have took her advice on her leaving the key at the front desk under her name! My mistake. I will see her again, but will have to make sure that doesn't happen again."
  },
  {
    "username": "Dilfindisguise",
    "comment": "I saw her a couple of times in Vancouver and I’ve seen her three or four times in Halifax. We really clicked the very first time, and nothing has changed since. I asked her to keep her natural russian accent instead of her English one which made the experience more sensual or maybe it’s just a kink I have. She’s a great companion."
  },
  {
    "username": "richpapi1963",
    "comment": "I’m not one to leave reviews but this girl has done such amazing services for me for the past few months. Just flew her to Singapore as I was missing our time together and had the best 4 days of my life. She is a very smart girl which is what I noticed the first time I booked her when I saw how she takes deposits as it truly is the safest way to pay for services. I paid for all our sessions together by buying her art as many times as I pleased. She isn’t as available as she used to be but as I’m leaving Canada permanently due to work I thought this review could do some justice. Cheers."
  },
  {
    "username": "Wreckdatpus",
    "comment": "My recent encounter with the russian princess was just as enjoyable as all the previous ones. I called her early one afternoon to make a one hour appointment for later that day. As soon as I arrived at her apartment, she greeted me with a big hug and kiss. As usual, we were off to a roaring start. I handed her the envelope, and excused myself to wash up. When I exited the bathroom, she was waiting for me in a scantily-clad state. We immediately started DFKing and caressing led to groping. Soon, all her undies were off, and I was sucking on her amazing DD sized boobs. She obviously enjoys that, but not as much as DATY, which was the logical next step. She is fully shaven, and her pink look so yummy against her pearl skin. They are just as yummy as they look, too. As usual, it didn’t take long at all for this goddess to erupt. When she had settled down, it was my turn to squirm. 100% excellent oral skills, among the finest i’ve been with.. She doesn’t just suck and pump your cock; she makes love to it. After several minutes of those lovely sensations that only happen when the BJ is uncovered, I needed to take a break to avoid a sensory overload and a premature finish. So, the obvious solution was another round of DATY, with the same result as the first. She then resumed the BJ briefly, and then rolled on the cover. I knew the FS part of the festivities was not going to be a marathon, given my highly aroused state, and started in mish. Soon the action was very frenzied, and her third O was followed soon after by my own thundering finish. There certainly wasn’t enough time for an old guy like me to manage a second round, so we cuddled and chatted about nothing in particular until my time was up. 100% not a clock watcher, and she obviously enjoys her work, as long as the client is clean and respectful. She’s intelligent and can engage in adult conversation. I can certainly recommend her to guys who love full GFE encounters and she does happen to be good at PSE! I will continue to repeat."
  },
  {
    "username": "ColdSummer1530",
    "comment": "Was my first time seeing someone new in quite a while, and I have to say I am really glad I reached out to her in her first visit here to Winnipeg. After passing the banana inspection we got to know each other a little bit and then it seemed like I was on the verge of gasping for air the rest of the visit as she LOVES to kiss, and so do I I won't go into the details of what else went on, but she's got a beautiful smile and was very easy to open up to. I had a great time and would definitely repeat in the future. Treat her well guys, she's a gem!"
  },
  {
    "username": "dappy0928",
    "comment": "Very communicative girl, gave me heads up she was dealing with a situation and asked to see melater and made it up to me big time so no complaints from me! Did the PSE experience with greek and was definitely one of my the best experiences ive had with an SP."
  },
  {
    "username": "BlackKnight0287",
    "comment": "Wish she was uglier so I can stop spending my low pay with how inflations are right now"
  },
  {
    "username": "HornyCanadian629",
    "comment": "Greetings Gents, I've decided to finally contribute. All though it almost pains me as I would like her all to myself 😅 here is my first review! I have been seeing this russian princess on and off pretty much since she started working. Lots in the beginning haha but after a week I caved in and saw her again a week ago... and... I'm hooked again! She is exactly as advertised. Sweet, petite, soft, extremely seductive. She is just gorgeous guys. Long brown hair, VERY pretty green eyes, beautiful face. Super cute Russian voice and personality. Tight sexy little body with just the right amount of curves exactly where you want them. At least for me haha! Very feminine and natural. Me and her really hit it off, or at least shes really good at making me feel that way. It feels real with her. I often have troubles with nervousness doing this but I feel safe with her. Getting down to it... wont go into detail besides this: Im not thinking about seeing anyone else. Her bits of dirty talk, F@$% me I cant get that out of my thoughts. Her incall location has changed over time as she travels right now its in a neighborhood so felt a bit nervous and out of place. But I always feel that way going to a new location for this. Anyways short story long I'm infatuated with this one. Please treat her well guys, she deserves it. You wont be disappointed. Or dont go see her and leave her all for me 😈"
  },
  {
    "username": "pussyfighter8726",
    "comment": "Left her a review on http://www.spain-ppr.com/ but to summarize she’s fucking amazing at what she does."
  },
  {
    "username": "Mrbadmanz",
    "comment": "Finally saw her after our schedules not aligning, unfortunately my etransfer system was done but I did the deposit with amazon egiftcard which was surprisingly fast. If it wasnt for all her reviews i dont think i would have continued and if i didnt have continued i realized i wouldnt have met this exotic woman so thank you to those spanish and brazilians who wrote reviews hahaha 10/10 service 10/10 face pricing was the only downside as she is pretty expensive but hey you are literally paying for what you get and she is worth it"
  },
  {
    "username": "projectneymar",
    "comment": "Saw her the day before she was leaving to Canada here in Sao Paulo jaja her blowjob was 10/10 and very intelligent women, sad that she was in brazil only for little bit of time which i understand cause of whats been happening in the city lately"
  }
]
